In [1]:
import pandas as pd
import sqlalchemy as sa

engine = sa.create_engine("mysql+pymysql://root:Birmingham%40123@localhost/abi")

In [6]:
df = pd.read_sql_table('customer', engine)

df

     Customer Name  Customer Phone
0     rafael nadal      4567895647
1  maria sharapova       434534545
2   vladimir putin        89345345
3      kim un jong       123434456
4       jeff bezos       934534543
5     rahul gandhi        44324222

In [7]:
df = pd.read_sql_table('orders', engine)

df

   id name       phone
0   1  Abi  9894469812

In [8]:
df = pd.read_sql_table('orders', engine,columns=['phone'])

df

        phone
0  9894469812

In [11]:

## we can also write our own SQL queries
query = ''' select customer.name , customer.amount , orders.phone
from customer inner join orders
on customer.id = orders.customer_id'''

df = pd.read_sql_query(query, engine)
df

       name  amount       phone
0  Abisheck      25  9894469812

In [30]:
df1 =pd.read_csv('customers.csv')
df1

     Customer Name  Customer Phone
0     rafael nadal      4567895647
1  maria sharapova       434534545
2   vladimir putin        89345345
3      kim un jong       123434456
4       jeff bezos       934534543
5     rahul gandhi        44324222

In [5]:
df2 = df1.rename(columns={
    'Customer Name' : 'Name',
    'Customer Phone' : 'Phone'
})
df1

NameError: name 'df1' is not defined

In [32]:
df1.to_sql('user_details', engine, if_exists='replace', index=False)

6